In [1]:
import pandas as pd
india_weather = pd.DataFrame({
    "city" : ["mumbai", "delhi", "blr"],
    "temperature": [23,33,21],
    "humidity": [77,60,78]
})
india_weather

     city  temperature  humidity
0  mumbai           23        77
1   delhi           33        60
2     blr           21        78

In [2]:
usa_weather = pd.DataFrame({
    "city" : ["new york", "california", "chicago"],
    "temperature": [20,30,20],
    "humidity": [71,62,74]
})
usa_weather

         city  temperature  humidity
0    new york           20        71
1  california           30        62
2     chicago           20        74

# to concatenate 2 or more dataframes in pandas, use pd.concat() function

In [3]:
df = pd.concat([india_weather, usa_weather])
df

         city  temperature  humidity
0      mumbai           23        77
1       delhi           33        60
2         blr           21        78
0    new york           20        71
1  california           30        62
2     chicago           20        74

# to have the continuous index use, ignore_index = True

In [4]:
df = pd.concat([india_weather, usa_weather], ignore_index=True)
df

         city  temperature  humidity
0      mumbai           23        77
1       delhi           33        60
2         blr           21        78
3    new york           20        71
4  california           30        62
5     chicago           20        74

In [5]:
df = pd.concat([india_weather, usa_weather],  keys=["india", "usa"])
df

               city  temperature  humidity
india 0      mumbai           23        77
      1       delhi           33        60
      2         blr           21        78
usa   0    new york           20        71
      1  california           30        62
      2     chicago           20        74

In [6]:
df.loc["india"]

     city  temperature  humidity
0  mumbai           23        77
1   delhi           33        60
2     blr           21        78

# if you want to concatenate 2 dataframes which are having some same column and concatenate them as a column rather than row, use axis = 1

In [8]:
temp_df = pd.DataFrame({
    "city" : ["mumbai", "delhi", "blr"],
    "temperature": [23,33,21],

})
temp_df

     city  temperature
0  mumbai           23
1   delhi           33
2     blr           21

In [9]:

windspeed_df = pd.DataFrame({
    "city" : ["mumbai", "delhi", "blr"],
    "windspeed": [6,3,12],

})
windspeed_df

     city  windspeed
0  mumbai          6
1   delhi          3
2     blr         12

In [11]:
df = pd.concat([temp_df, windspeed_df], axis=1)
df

     city  temperature    city  windspeed
0  mumbai           23  mumbai          6
1   delhi           33   delhi          3
2     blr           21     blr         12

In [12]:
s = pd.Series(["Humid", "Dry","Rain"], name = "event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [13]:
df = pd.concat([temp_df, s], axis = 1)
df

     city  temperature  event
0  mumbai           23  Humid
1   delhi           33    Dry
2     blr           21   Rain